a1 = input ("小精灵：您好欢迎来到古灵阁，请问您需要帮助吗？需要OR不需要\n") 
if a1 == "需要":
    print("小精灵：请问您需要什么帮助呢？ 1、存取款 2、货币兑换、3、咨询")
    num = int(input ("请您选择：\n"))
    if num == 1:
            print("小精灵会推荐你去存取款窗口")
    elif num == 2:
            print("小精灵：金加隆和人民币的兑换率为1:51.3，即一金加隆=51.3人民币")
            mony=float(input("小精灵：请问您需要兑换多少金加隆？\n"))
            print("小精灵：好的，我知道了，您需要兑换",mony,"金加隆。")
            mony1 = mony * 51.3
            print("小精灵：那么您需要付给我" ,mony1,"人民币")        
    elif num == 3:
            print("小精灵会推荐您去咨询窗口")
    else:
            print("对不起您输入错误")
else:
        print("再见！欢迎下次再来！！！")

